ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/PeripheralPins.c
// MBED_WEAK const PinMap PinMap_SPI_CLK[] = {
// #ifdef USART0_BASE
    // /* USART0 */
    // {PA0,  SPI_0, 30},
    // {PA1,  SPI_0, 31},
    // {PA2,  SPI_0,  0},
    // {PA3,  SPI_0,  1},
    // {PA4,  SPI_0,  2},
    // {PA5,  SPI_0,  3},
    // {PB11, SPI_0,  4},
    // {PB12, SPI_0,  5},
    // {PB13, SPI_0,  6},
    // {PB14, SPI_0,  7},
    // {PB15, SPI_0,  8},
    // {PD9,  SPI_0, 15},
    // {PD10, SPI_0, 16},
    // {PD11, SPI_0, 17},
    // {PD12, SPI_0, 18},
    // {PD13, SPI_0, 19},
    // {PD14, SPI_0, 20},
    // {PD15, SPI_0, 21},
// #endif
// #ifdef USART1_BASE
    // /* USART1 */
    // {PC6,  SPI_1,  9},
    // {PC7,  SPI_1, 10},
    // {PC8,  SPI_1, 11},
    // {PC9,  SPI_1, 12},
    // {PC10, SPI_1, 13},
    // {PC11, SPI_1, 14},
    // {PF0,  SPI_1, 22},
    // {PF1,  SPI_1, 23},
    // {PF2,  SPI_1, 24},
    // {PF3,  SPI_1, 25},
    // {PF4,  SPI_1, 26},
    // {PF5,  SPI_1, 27},
    // {PF6,  SPI_1, 28},
    // {PA0,  SPI_1, 30},
    // {PA1,  SPI_1, 31},
// #endif
// #ifdef USART2_BASE
    // /* USART2 */
    // {PA7,  SPI_2, 0},
    // {PA8,  SPI_2, 1},
    // {PA9,  SPI_2, 2},
    // {PI0,  SPI_2, 3},
    // {PI1,  SPI_2, 4},
    // {PI2,  SPI_2, 5},
    // {PI3,  SPI_2, 6},
    // {PB6,  SPI_2, 7},
    // {PB7,  SPI_2, 8},
    // {PB8,  SPI_2, 9},
    // {PB9,  SPI_2, 10},
    // {PB10, SPI_2, 11},
    // {PF7,  SPI_2, 18},
    // {PF8,  SPI_2, 19},
    // {PF9,  SPI_2, 20},
    // {PF10, SPI_2, 21},
    // {PF11, SPI_2, 22},
    // {PF12, SPI_2, 23},
    // {PF13, SPI_2, 24},
    // {PF14, SPI_2, 25},
    // {PF15, SPI_2, 26},
    // {PK0,  SPI_2, 27},
    // {PK1,  SPI_2, 28},
    // {PK2,  SPI_2, 29},
    // {PA6,  SPI_2, 31},
// #endif
// #ifdef USART3_BASE
    // /* USART3 */
    // {PJ14, SPI_3, 14},
    // {PJ15, SPI_3, 15},
    // {PC0,  SPI_3, 16},
    // {PC1,  SPI_3, 17},
    // {PC2,  SPI_3, 18},
    // {PC3,  SPI_3, 19},
    // {PC4,  SPI_3, 20},
    // {PC5,  SPI_3, 21},
// #endif
    // {NC  , NC   , NC}
// };

// MBED_WEAK const PinMap PinMap_SPI_CS[] = {
// #ifdef USART0_BASE
    // /* USART0 */
    // {PA0,  SPI_0,  29},
    // {PA1,  SPI_0,  30},
    // {PA2,  SPI_0,  31},
    // {PA3,  SPI_0,  0},
    // {PA4,  SPI_0,  1},
    // {PA5,  SPI_0,  2},
    // {PB11, SPI_0,  3},
    // {PB12, SPI_0,  4},
    // {PB13, SPI_0,  5},
    // {PB14, SPI_0,  6},
    // {PB15, SPI_0,  7},
    // {PD9,  SPI_0, 14},
    // {PD10, SPI_0, 15},
    // {PD11, SPI_0, 16},
    // {PD12, SPI_0, 17},
    // {PD13, SPI_0, 18},
    // {PD14, SPI_0, 19},
    // {PD15, SPI_0, 20},
// #endif
// #ifdef USART1_BASE
    // /* USART1 */
    // {PC6,  SPI_1,  8},
    // {PC7,  SPI_1,  9},
    // {PC8,  SPI_1, 10},
    // {PC9,  SPI_1, 11},
    // {PC10, SPI_1, 12},
    // {PC11, SPI_1, 13},
    // {PF0,  SPI_1, 21},
    // {PF1,  SPI_1, 22},
    // {PF2,  SPI_1, 23},
    // {PF3,  SPI_1, 24},
    // {PF4,  SPI_1, 25},
    // {PF5,  SPI_1, 26},
    // {PF6,  SPI_1, 27},
// #endif
// #ifdef USART2_BASE
    // /* USART2 */
    // {PA8,  SPI_2, 0},
    // {PA9,  SPI_2, 1},
    // {PI0,  SPI_2, 2},
    // {PI1,  SPI_2, 3},
    // {PI2,  SPI_2, 4},
    // {PI3,  SPI_2, 5},
    // {PB6,  SPI_2, 6},
    // {PB7,  SPI_2, 7},
    // {PB8,  SPI_2, 8},
    // {PB9,  SPI_2, 9},
    // {PB10, SPI_2, 10},
    // {PF7,  SPI_2, 17},
    // {PF8,  SPI_2, 18},
    // {PF9,  SPI_2, 19},
    // {PF10, SPI_2, 20},
    // {PF11, SPI_2, 21},
    // {PF12, SPI_2, 22},
    // {PF13, SPI_2, 23},
    // {PF14, SPI_2, 24},
    // {PF15, SPI_2, 25},
    // {PK0,  SPI_2, 26},
    // {PK1,  SPI_2, 27},
    // {PK2,  SPI_2, 28},
    // {PA6,  SPI_2, 30},
    // {PA7,  SPI_2, 31},
// #endif
// #ifdef USART3_BASE
    // /* USART3 */
    // {PJ14, SPI_3, 13},
    // {PJ15, SPI_3, 14},
    // {PC0,  SPI_3, 15},
    // {PC1,  SPI_3, 16},
    // {PC2,  SPI_3, 17},
    // {PC3,  SPI_3, 18},
    // {PC4,  SPI_3, 19},
    // {PC5,  SPI_3, 20},
// #endif
    // {NC  , NC   , NC}
// };

/************UART**************/
MBED_WEAK const PinMap PinMap_UART_TX[] = {
    /* USART0 */
    {PIO_PA4_IDX, USART_0, PIO_PA4A_FLEXCOM0_IO0},
    // {PA1,  USART_0,  1},
    // {PA2,  USART_0,  2},
    // {PA3,  USART_0,  3},
    // {PA4,  USART_0,  4},
    // {PA5,  USART_0,  5},
    // {PB11, USART_0,  6},
    // {PB12, USART_0,  7},
    // {PB13, USART_0,  8},
    // {PB14, USART_0,  9},
    // {PB15, USART_0, 10},
    // /* USART1 */
    // {PC6,  USART_1, 11},
    // {PC7,  USART_1, 12},
    // {PC8,  USART_1, 13},
    // {PC9,  USART_1, 14},
    // {PC10, USART_1, 15},
    // {PC11, USART_1, 16},
    // {PF0,  USART_1, 24},
    // {PF1,  USART_1, 25},
    // {PF2,  USART_1, 26},
    // {PF3,  USART_1, 27},
    // {PF4,  USART_1, 28},
    // {PF5,  USART_1, 29},
    // {PF6,  USART_1, 30},
    // {PF7,  USART_1, 31},
// #endif
// #ifdef USART2_BASE
    // /* USART2 */
    // {PA6,  USART_2, 1},
    // {PA7,  USART_2, 2},
    // {PA8,  USART_2, 3},
    // {PA9,  USART_2, 4},
    // {PI0,  USART_2, 5},
    // {PI1,  USART_2, 6},
    // {PI2,  USART_2, 7},
    // {PI3,  USART_2, 8},
    // {PB6,  USART_2, 9},
    // {PB7,  USART_2, 10},
    // {PB8,  USART_2, 11},
    // {PB9,  USART_2, 12},
    // {PB10, USART_2, 13},
    // {PF8,  USART_2, 21},
    // {PF9,  USART_2, 22},
    // {PF10, USART_2, 23},
    // {PF11, USART_2, 24},
    // {PF12, USART_2, 25},
    // {PF13, USART_2, 26},
    // {PF14, USART_2, 27},
    // {PF15, USART_2, 28},
    // {PK0,  USART_2, 29},
    // {PK1,  USART_2, 30},
    // {PK2,  USART_2, 31},
// #endif
// #ifdef USART3_BASE
    // /* USART3 */
    // {PJ14, USART_3, 16},
    // {PJ15, USART_3, 17},
    // {PC0,  USART_3, 18},
    // {PC1,  USART_3, 19},
    // {PC2,  USART_3, 20},
    // {PC3,  USART_3, 21},
    // {PC4,  USART_3, 22},
    // {PC5,  USART_3, 23},
// #endif
    {NC, NC, 0}
};

MBED_WEAK const PinMap PinMap_UART_RX[] = {
    /* USART0 */
    {PIO_PA5_IDX, USART_0, PIO_PA5A_FLEXCOM0_IO1},
    // {PA1,  USART_0,  0},
    // {PA2,  USART_0,  1},
    // {PA3,  USART_0,  2},
    // {PA4,  USART_0,  3},
    // {PA5,  USART_0,  4},
    // {PB11, USART_0,  5},
    // {PB12, USART_0,  6},
    // {PB13, USART_0,  7},
    // {PB14, USART_0,  8},
    // {PB15, USART_0,  9},
// #ifdef USART1_BASE
    // /* USART1 */
    // {PC6,  USART_1, 10},
    // {PC7,  USART_1, 11},
    // {PC8,  USART_1, 12},
    // {PC9,  USART_1, 13},
    // {PC10, USART_1, 14},
    // {PC11, USART_1, 15},
    // {PF0,  USART_1, 23},
    // {PF1,  USART_1, 24},
    // {PF2,  USART_1, 25},
    // {PF3,  USART_1, 26},
    // {PF4,  USART_1, 27},
    // {PF5,  USART_1, 28},
    // {PF6,  USART_1, 29},
    // {PF7,  USART_1, 30},
// #endif
// #ifdef USART2_BASE
    // /* USART2 */
    // {PA6,  USART_2, 0},
    // {PA7,  USART_2, 1},
    // {PA8,  USART_2, 2},
    // {PA9,  USART_2, 3},
    // {PI0,  USART_2, 4},
    // {PI1,  USART_2, 5},
    // {PI2,  USART_2, 6},
    // {PI3,  USART_2, 7},
    // {PB6,  USART_2, 8},
    // {PB7,  USART_2, 9},
    // {PB8,  USART_2, 10},
    // {PB9,  USART_2, 11},
    // {PB10, USART_2, 12},
    // {PF8,  USART_2, 20},
    // {PF9,  USART_2, 21},
    // {PF10, USART_2, 22},
    // {PF11, USART_2, 23},
    // {PF12, USART_2, 24},
    // {PF13, USART_2, 25},
    // {PF14, USART_2, 26},
    // {PF15, USART_2, 27},
    // {PK0,  USART_2, 28},
    // {PK1,  USART_2, 29},
    // {PK2,  USART_2, 30},
// #endif
// #ifdef USART3_BASE
    // /* USART3 */
    // {PJ14, USART_3, 15},
    // {PJ15, USART_3, 16},
    // {PC0,  USART_3, 17},
    // {PC1,  USART_3, 18},
    // {PC2,  USART_3, 19},
    // {PC3,  USART_3, 20},
    // {PC4,  USART_3, 21},
    // {PC5,  USART_3, 22},
// #endif
    {NC, NC, 0}
};


MBED_WEAK const PinMap PinMap_UART_SCK[] = {
	/* USART0 */
    {PIO_PA6_IDX, USART_0, PIO_PA6A_FLEXCOM0_IO2},
    {NC, NC, 0}
};

MBED_WEAK const PinMap PinMap_UART_CTS[] = {
	/* USART0 */
    {PIO_PA7_IDX, USART_0, PIO_PA7A_FLEXCOM0_IO3},
    {NC, NC, 0}
};

MBED_WEAK const PinMap PinMap_UART_RTS[] = {
	/* USART0 */
    {PIO_PA6_IDX, USART_0, PIO_PA6B_FLEXCOM0_IO4},
    {NC, NC, 0}
};

